CarRentWebApp/CarRentWebApp/Service References/CarServiceReference/GetCarsWSDL.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns="http://WS.KutzCarRental/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarsWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:ns0="http://WS.BechCarRental/" xmlns="http://schemas.xmlsoap.org/wsdl/" name="GetCarsWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarsWSDL" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <plnk:partnerLinkType name="GetCarsWSDL">
    <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
    <plnk:role name="GetCarsWSDLPortTypeRole" portType="tns:GetCarsWSDLPortType" />
  </plnk:partnerLinkType>
  <wsdl:types>
    <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarsWSDL">
      <xsd:import schemaLocation="http://localhost:8080/KutzCarRentalWS/KutzCarRentalWS?xsd=1" namespace="http://WS.KutzCarRental/" />
      <xsd:import schemaLocation="http://localhost:8080/BechCarRentalWS/BechCarRentalWS?xsd=1" namespace="http://WS.BechCarRental/" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="GetCarsWSDLOperationRequest" />
  <wsdl:message name="GetCarsWSDLOperationResponse">
    <wsdl:part name="kutzCars" type="ns:getCarsResponse" />
    <wsdl:part name="bechCars" type="ns0:getCarsResponse" />
  </wsdl:message>
  <wsdl:portType name="GetCarsWSDLPortType">
    <wsdl:operation name="GetCarsWSDLOperation">
      <wsdl:input name="input1" message="tns:GetCarsWSDLOperationRequest" />
      <wsdl:output name="output1" message="tns:GetCarsWSDLOperationResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="GetCarsWSDLBinding" type="tns:GetCarsWSDLPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="GetCarsWSDLOperation">
      <soap:operation soapAction="" />
      <wsdl:input name="input1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarsWSDL" />
      </wsdl:input>
      <wsdl:output name="output1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarsWSDL" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="GetCarsWSDLService">
    <wsdl:port name="GetCarsWSDLPort" binding="tns:GetCarsWSDLBinding">
      <soap:address location="http://192.168.1.77:9080/GetCarsWSDLService/GetCarsWSDLPort" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>